In [1]:
pip install openpyxl

Requirement already satisfied: openpyxl in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (3.0.6)
Requirement already satisfied: jdcal in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (from openpyxl) (1.4.1)
Requirement already satisfied: et-xmlfile in /Users/annabelcheong/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages (from openpyxl) (1.0.1)
Note: you may need to restart the kernel to use updated packages.

In [2]:
import pandas as pd

In [3]:
q32015 = "../housingcsv/2015q3.xlsx"
df1 = pd.read_excel(q32015,engine='openpyxl')
refine1 = df1.drop(['Sales\n3Q 2014', 'Median\n3Q 2014', 'Median\nChange'], axis=1)
refine1 = refine1.rename(columns={'Sales\n3Q 2015': 'Sales Q3 2015', 'Median\n3Q 2015': 'Median Q3 2015'})
refine1

               City          Suburb  Sales Q3 2015  Median Q3 2015
0          ADELAIDE        ADELAIDE            5.0        600000.0
1          ADELAIDE  NORTH ADELAIDE            6.0       1370000.0
2    ADELAIDE HILLS         ALDGATE            6.0        802500.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
472    WEST TORRENS       THEBARTON            3.0        546000.0
473    WEST TORRENS    TORRENSVILLE           12.0        602500.0
474    WEST TORRENS       UNDERDALE            7.0        580000.0
475    WEST TORRENS      WEST BEACH            8.0        728000.0
476    WEST TORRENS   WEST RICHMOND            3.0        392500.0

[477 rows x 4 columns]

In [4]:
q42015 = '../housingcsv/2015q4.xlsx'
df2 = pd.read_excel(q42015,engine='openpyxl')
refine2 = df2.drop(['Sales\n4Q 2014', 'Median\n4Q 2014', 'Median\nChange'], axis=1)
refine2 = refine2.rename(columns={'Sales\n4Q 2015': 'Sales Q4 2015', 'Median\n4Q 2015': 'Median Q4 2015'})
refine2

               City          Suburb  Sales Q4 2015  Median Q4 2015
0          ADELAIDE        ADELAIDE            5.0        320000.0
1          ADELAIDE  NORTH ADELAIDE            4.0       1300000.0
2    ADELAIDE HILLS         ALDGATE            7.0        668750.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
473    WEST TORRENS    TORRENSVILLE           10.0        576250.0
474    WEST TORRENS       UNDERDALE            3.0        511000.0
475    WEST TORRENS      WEST BEACH            8.0        633500.0
476    WEST TORRENS   WEST RICHMOND            4.0        353000.0
477             NaN             NaN            NaN             NaN

[478 rows x 4 columns]

In [5]:
q12016 = '../housingcsv/2016q1.xlsx'
df3 = pd.read_excel(q12016,engine='openpyxl')
refine3 = df3.drop(['Sales\n1Q 2015', 'Median\n1Q 2015', 'Median\nChange'], axis=1)
refine3 = refine3.rename(columns={'Sales\n1Q 2016': 'Sales Q1 2016', 'Median\n1Q 2016': 'Median Q1 2016'})
refine3

               City          Suburb  Sales Q1 2016  Median Q1 2016
0          ADELAIDE        ADELAIDE            3.0        750000.0
1          ADELAIDE  NORTH ADELAIDE           10.0        900500.0
2    ADELAIDE HILLS         ALDGATE           13.0        715000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
473    WEST TORRENS    TORRENSVILLE            7.0        537500.0
474    WEST TORRENS       UNDERDALE            3.0        533000.0
475    WEST TORRENS      WEST BEACH            7.0        825000.0
476    WEST TORRENS   WEST RICHMOND            3.0        410000.0
477             NaN             NaN            NaN             NaN

[478 rows x 4 columns]

In [6]:
q22016 = '../housingcsv/2016q2.xlsx'
df4 = pd.read_excel(q22016,engine='openpyxl')
refine4 = df4.drop(['Sales\n2Q 2015', 'Median\n2Q 2015', 'Median\nChange'], axis=1)
refine4 = refine4.rename(columns={'Sales\n2Q 2016': 'Sales Q2 2016', 'Median\n2Q 2016': 'Median Q2 2016'})
refine4

               City          Suburb  Sales Q2 2016  Median Q2 2016
0          ADELAIDE        ADELAIDE            NaN             NaN
1          ADELAIDE  NORTH ADELAIDE           14.0        892500.0
2    ADELAIDE HILLS         ALDGATE           16.0        750000.0
3    ADELAIDE HILLS          ASHTON            NaN             NaN
4    ADELAIDE HILLS    BASKET RANGE            NaN             NaN
..              ...             ...            ...             ...
473    WEST TORRENS       THEBARTON            6.0        498750.0
474    WEST TORRENS    TORRENSVILLE            7.0        627500.0
475    WEST TORRENS       UNDERDALE            8.0        529000.0
476    WEST TORRENS      WEST BEACH            7.0        706000.0
477    WEST TORRENS   WEST RICHMOND            1.0        390000.0

[478 rows x 4 columns]

In [7]:
merged1 = pd.merge(refine1,refine2)
merged2 = pd.merge(refine3,refine4)
final = pd.merge(merged1,merged2)
final = final.dropna(how='any')
final

,City,Suburb,Sales Q3 2015,Median Q3 2015,Sales Q4 2015,Median Q4 2015,Sales Q1 2016,Median Q1 2016,Sales Q2 2016,Median Q2 2016
1,ADELAIDE,NORTH ADELAIDE,6.0,1370000.0,4.0,1300000.0,10.0,900500.0,14.0,892500.0
2,ADELAIDE HILLS,ALDGATE,6.0,802500.0,7.0,668750.0,13.0,715000.0,16.0,750000.0
5,ADELAIDE HILLS,BELAIR,23.0,540000.0,16.0,550000.0,13.0,577500.0,15.0,561000.0
7,ADELAIDE HILLS,BRIDGEWATER,16.0,465000.0,12.0,477000.0,16.0,475000.0,18.0,432000.0
12,ADELAIDE HILLS,CRAFERS,7.0,617500.0,3.0,678250.0,8.0,640500.0,3.0,537000.0
...,...,...,...,...,...,...,...,...,...,...
471,WEST TORRENS,RICHMOND,9.0,420000.0,4.0,526500.0,11.0,456500.0,10.0,546000.0
473,WEST TORRENS,TORRENSVILLE,12.0,602500.0,10.0,576250.0,7.0,537500.0,7.0,627500.0
474,WEST TORRENS,UNDERDALE,7.0,580000.0,3.0,511000.0,3.0,533000.0,8.0,529000.0
475,WEST TORRENS,WEST BEACH,8.0,728000.0,8.0,633500.0,7.0,825000.0,7.0,706000.0
476,WEST TORRENS,WEST RICHMOND,3.0,392500.0,4.0,353000.0,3.0,410000.0,1.0,390000.0

In [8]:
final.to_csv("y15_16_house.csv")